
«Восточный Стикс» - школа для подростков из неблагополучных семей, расположенная на склоне горы Элипак. Внешне напоминает больше тюрьму, чем школу: высокий забор украшенный колючей проволокой, вышки со снайперами. Если кто-то питает иллюзии, что здесь обучаются дети со сверхспособностями или 

 располагалась на закрытой территории. Здесь обучались самые отмороженные дети. Были здесь и из неблагополучных семей, и с приводами в полицию, одним словом будущие уголовники.
Каникулы закончились, выпал первый снег. Ребята гурьбой выбежали на улицу. Параллельные классы давно точили зуб друг на друга. Мальчики стали лепить снежки и кидаться. Постепенно толпа разделилась на две команды. Среди учащихся частенько случались потасовки.
Этот день не стал исключением. Коля увидел злейшего врага – ученика параллельного класса Гришу Полякова.
- Иди сюда, козлина! Я тебя урою.
Бросок.
Гриша ловко уклонялся от ледяного шара. Снежок пролетел через поле и угодил в голову затаившемуся школьнику, который прятался за углом школы.
- Попробуй, силенок то хватит?
Слева бежали два рослых брата, Степка и Петя. Они прыгнули на Гришу и попытались его повалить. Поляков отпрыгнул в сторону и правым хуком вырубил одного из нападавших.
Петя с ревом бросился на обидчика брата. Последовали жесткие удары по корпусу и в голову. Гриша пропустил мощный удар в челюсть, но переставал стоять.
К дерущимся подоспел Коля. Удар ногой в прыжке повалил Гришу на землю. Вдвоем с Колей они стали бить его ногами и валять в пыли.
Раздался звук свистка. С матами к ним приближался учитель физкультуры. Ребята бросились в рассыпную.




лышали ли вы про такой подростковый феномен, как сниффинг? Речь не про хакерские штучки, а про токсикоманию. Ребята легального прихода ради распыляют газ в пакет, после чего вдыхают. 

15-летний Игорь Яковлев из Солнечногорска, к сожалению, об этой забаве знал. Поэтому в пятницу устроился с освежителем воздуха на детской площадке и приготовился кайфануть. Закончилось всё плачевно: тело парня нашли вечером того же дня. Рядом — пустой баллончик марки "Эконта".








микрофронтенд
поды
докер
модуль федерейнш

V97-1785


контекст , замыкание, итераторы и генераторы 
понимать откуда у примитивов есть методы по типо .toString
евент луп, сборщик мусора
прототипное наследование